app/views/employees/_form.html.erb

    <%#= f.text_field :email_address, readonly: true %>
    <%= f.select :email_address, options_for_select(User.select(:email).collect {|p| [ p.email, p.email ] })%>
---
SELECT "users"."email" FROM "users"