app/views/clients/_client_links.html.erb

SELECT  "categories".* FROM "categories" INNER JOIN "categories_clients" ON "categories"."id" = "categories_clients"."category_id" WHERE "categories_clients"."client_id" = $1  ORDER BY "categories"."id" ASC LIMIT 1  [["client_id", 1]]
---
<% if !client.is_active && client.schedules %>
<% rate_value = client.categories.first.rate.value %>