app/views/clients/index.html.erb

SELECT  "schedules".* FROM "schedules" WHERE "schedules"."client_id" = $1  ORDER BY "schedules"."id" DESC LIMIT 1  [["client_id", 1]]
---
        <td id=<%= "started_at_cell_#{client.id}" %>>
          <%= client.is_active ? get_local_time(client.schedules.last.start_time): "Not started"%>

SELECT  "schedules".* FROM "schedules" WHERE "schedules"."client_id" = $1  ORDER BY "schedules"."id" ASC LIMIT 1  [["client_id", 1]]
---
        <td id=<%= "ended_at_cell_#{client.id}" %>>
          <%= client.is_active ? client.schedules.last.end_time ? get_local_time(client.schedules.first.end_time) : "Session in progress" : "Not Started"%>