app/views/welcome/index.html.erb

SELECT "clients".* FROM "clients" WHERE (date(expected_schedule) between '2017-01-09' and '2017-01-15')  ORDER BY "clients"."expected_schedule" DESC
SELECT COUNT(*) AS count_all, date(expected_schedule) AS date_expected_schedule FROM "clients" WHERE (date(expected_schedule) between '2017-01-09' and '2017-01-15') GROUP BY date(expected_schedule)
SELECT COUNT(*) AS count_all, name AS name FROM "clients" GROUP BY "clients"."name"
---
    <h3>Schedules Chart </h3>
      <%=column_chart Client.bookings(params[:selector]).group("date(expected_schedule)").count , label: "Schedules" %>
      <%= pie_chart Client.group(:name).count %>