app/controllers/clients_controller.rb

SELECT  "clients".* FROM "clients" WHERE (lower(name) LIKE '%tejas%') LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "clients"
---
  def index
    @clients = Client.search(params[:search]).paginate(:per_page => 2, :page => params[:page]) #.where(is_active: true)

INSERT INTO "clients" ("name", "contact_no", "email_address", "project_name", "identity_document", "identity_number", "employee_id", "expected_schedule", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save

UPDATE "clients" SET "email_address" = $1, "employee_id" = $2, "expected_schedule" = $3, "updated_at" = $4 WHERE "clients"."id" = $5  [["email_address", "emails"], ["employee_id", 1], ["expected_schedule", "2016-12-28 10:08:33.000000"], ["updated_at", "2016-12-28 10:08:40.519656"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @client.update(client_params)

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_client
      @client = Client.find(params[:id])