app/controllers/employees_controller.rb

  def index
    @employees = Employee.all
---
SELECT "employees".* FROM "employees"

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("emp_id", "name", "contact_no", "email_address", "identity_document", "identity_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @employee.update(employee_params)
        current_user.update_attributes(admin: params[:admin]) unless current_user.admin.to_s == params[:admin]
---
UPDATE "users" SET "admin" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["admin", nil], ["updated_at", "2016-12-22 09:03:37.663181"], ["id", 1]]

    def set_employee
      @employee = Employee.find(params[:id])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT 1  [["id", 3]]