app/controllers/events_controller.rb

INSERT INTO "events" ("bill_to_name", "bill_to_address", "category", "invoice_date", "particulars", "tax", "break_up_costing", "total", "invoice_no", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
INSERT INTO "invoices" ("category", "year", "event_id", "invoice_identifier", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["category", "bill"], ["year", 2016], ["event_id", 2], ["invoice_identifier", 1], ["created_at", "2016-12-27 05:12:50.873488"], ["updated_at", "2016-12-27 05:12:50.873488"]]
---
  def create_event_bill
    if params[:id]
      set_event_params
    else
      @event = Event.new(event_params)
      particulars = params["event"]["particulars"]
      tax = params["event"]["tax"]
      @event.particulars =  Hash[*particulars] if particulars
      @event.tax =  get_tax_hash(tax) if tax
      @event.total = calculate_total
      @event.invoice_no = calculate_invoice
      @event.save

SELECT "events".* FROM "events" WHERE (lower(bill_to_name) LIKE '%spm%')
---
  def index
    @events = Event.search(params[:search])

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
---
  def set_event_params
    @event = Event.find(params[:id])