app/controllers/rates_controller.rb

SELECT "rates".* FROM "rates"
---
  def index
    @rates = Rate.all

INSERT INTO "rates" ("value", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["value", 600], ["category_id", 1], ["created_at", "2016-12-06 06:49:57.689113"], ["updated_at", "2016-12-06 06:49:57.689113"]]
---
  def create
    @rate = Rate.new(rate_params)

    respond_to do |format|
      if @rate.save

SELECT  "rates".* FROM "rates" WHERE "rates"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_rate
      @rate = Rate.find(params[:id])