app/controllers/schedules_controller.rb

  def start_schedule
    set_client
    @schedule = Schedule.new({ start_time: Time.now, client_id: @client.id})
    @schedule.save
---
INSERT INTO "schedules" ("start_time", "client_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["start_time", "2016-12-06 09:37:27.185700"], ["client_id", 1], ["created_at", "2016-12-06 09:37:27.190700"], ["updated_at", "2016-12-06 09:37:27.190700"]]

  def stop_schedule
    set_client
    @client.schedules.last.update_attributes(end_time: Time.now)
---
SELECT  "schedules".* FROM "schedules" WHERE "schedules"."client_id" = $1  ORDER BY "schedules"."id" DESC LIMIT 1  [["client_id", 1]]
UPDATE "clients" SET "is_active" = $1, "updated_at" = $2 WHERE "clients"."id" = $3  [["is_active", "f"], ["updated_at", "2016-12-08 05:04:25.069024"], ["id", 1]]
UPDATE "schedules" SET "end_time" = $1, "updated_at" = $2 WHERE "schedules"."id" = $3  [["end_time", "2016-12-08 05:04:25.047021"], ["updated_at", "2016-12-08 05:04:25.048022"], ["id", 4]]

  def set_client
    @client = Client.find(params[:id])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT 1  [["id", 1]]