app/controllers/welcome_controller.rb

  def index
    @bookings = Client.bookings(params["selector"]).order(expected_schedule: :desc)
---
SELECT "clients".* FROM "clients" WHERE (date(expected_schedule) between '2017-01-09' and '2017-01-15')  ORDER BY "clients"."expected_schedule" DESC